/*17. Рожден ден

За рожденият ден на дъщеря си, Ивана е решила да организира парти, на което да покани всичките ѝ съученици. 
За целта е решила да наеме развлекателна зала за деца, чийто наем ще получите като вход от конзолата.

Напишете програма, с която да помогнете на Ивана да изчисли какъв бюджет ще ѝ бъде необходим, като имате следната 
информация за допълнителните неща, необходими за тържеството:

Торта - цената ѝ е 20% от наема на залата
Напитки - цената им е 45% по-малко от тази на тортата
Аниматор - цената му е 1/3 от цената за наема на залата*/
#include <iostream>

int main () {
    double rent; std::cin>>rent;
    double cake = rent / 5;
    double drinks = 0.55 * cake;
    double animator = rent / 3;

    std::cout<<"Total budget: "<<(rent + cake + drinks + animator)<<std::endl;
    return 0;
}