/*18. Пребоядисване

Румен иска да пребоядиса хола и за целта е наел майстори. Материалите за ремонта имат следните цени:

Предпазен найлон - 2.50 лв. за кв. метър
Боя - 14.25 лв. за литър
Разредител за боя - 5.00 лв. за литър
За всеки случай, към необходимите материали, Румен иска да добави още 10% от количеството боя и 3 кв. м. найлон, 
разбира се и 0.40 лв. за торбички. Сумата, която се заплаща на майсторите за 1 час труд, е равна на 30% от сбора 
на всички разходи за материали.

Напишете програма, при която се въвежда количествата на предпазения найлон, боята, разредителя за боята и часове 
труд на работниците. Програмата да пресмята и отпечата цената на ремонта.*/
#include <iostream>

int main () {
    double nylon, paint, thinner, hours; std::cin>>nylon>>paint>>thinner>>hours;
    paint = 1.1 * paint;
    nylon += 3;

    double materials = nylon * 2.5 + paint * 14.25 + thinner * 5 + 0.4;
    std::cout<<"Total cost: "<<materials + hours * 0.3 * materials<<" lv.\n";

    return 0;
}