//Задача 1: Въвежда се цяло число.Отпечатайте 1, ако числото е четно и 0, ако е нечетно.

//Задача 2: Въвежда се трицифрено цяло число n. Да се отпечата обърнатото число събрано с единица.

//Задача 3: Въвеждат се две числа. Да се отпечата по-голямото от двете.

//Задача 4: Въвежа се цяло число. Да се отпечата 1, ако числото е валидна оценка от училище, и 0, ако не е валидна.

//Задача 5: Въвежа се цяло число. Да се отпечата без последната цифра.

//Задача 6: Напишете програма, която въвежда две числа - a и b и извежда като резултат (a + b)^4 - (a-b)^2

//Задача 7: Въвежда се цяло число n - n лева. Да се изведе на конзолата как може да се разпределят по банкноти, така че да имаме минимален брой банкноти.
//В условието приемаме, че имаме банкноти от 1 и 2 лева.
#include <iostream>

int main()
{
	/*zad1
	int a;
	std::cin >> a;
	std::cout << !(a % 2);*/

	//zad2
	/*int n,n1,n2,n3;
	std::cin >> n;
	n3 = n % 10;
	n /= 10;
	n2 = n % 10;
	n1 = n / 10 + 1;
	std::cout << (n3 * 100 + n2*10 + n1);*/

	//zad3
	/*int a, b, c;
	std::cin >> a >> b;
	c = a > b;
	c = c * a + !c * b;
	std::cout << c;*/
	
	//zad4
	/*int a;
	std::cin >> a;
	std::cout << (a >= 2 && a <= 6);*/

	//zad5
	/*int a;
	std::cin >> a;
	std::cout << a / 10;*/

	//zad6
	//int a, b;
	//std::cin >> a >> b;
	//std::cout << ((a + b) * (a + b) * (a + b) * (a + b) - (a - b) * (a - b));

	//zad7
	int n;
	std::cin >> n;
	int bill100, bill50, bill20, bill10, bill5, bill2, bill1;
	bill100 = n / 100;
	n %= 100;
	bill50 = n / 50;
	n %= 50;
	bill20 = n / 20;
	n %= 20;
	bill10 = n / 10;
	n %= 10;
	bill5 = n / 5;
	n %= 5;
	bill2 = n / 2;
	n %= 2;
	bill1 = n;
	std::cout << bill100 << "x100lv " << bill50 << "x50lv " << bill20 << "x20lv " << bill10 << "x10lv " << bill5 << "x5lv " << bill2 << "x2lv " << bill1 << "x1lv";
}
