//zad1 Напишете програма, при която се въвежда двуцифрено цяло число.
//Програмата да отпечата 1 ако числото е валидна дата за януари, а в противен случай 0.

//zad2 Напишете програма за конвертиране на български лева (BGN) в евро (EUR) по курс 1.9558 (EUR -> BGN).

//zad3 Напишете програма, при която се въвежда положително цяло число. Програмата да отпечата последната му цифра.

//zad4 Въвежа се символ. Да се отпечата 1, ако е английска гласна буква, и 0, ако не е.

//zad5 Въвежа се малка латинска буква. Да се отпечата на екрана еквивалентната голяма буква.

//zad6 Напишете програма, при която се въвежда двуцифрено число. Да се намери произведението на цифрите му.

//zad7 Напишете програма, при която се въвежда трицифрено цяло число. Програмата да отпечата цифрите му разменени.

//zad8 Напишете програма, при която се въвежда трицифрено цяло число. Програмата да изчисли и отпечата сбора на цифрите му

//zad9 Напишете програма, която намира позицията на малка латинска буква в азбуката (a=1, b=2, ..., z=26).

//zad10 Въвеждат се 4 цели числа. Да се отпечата 1, ако числата образуват аритметична прогресия в реда, 
// в който са въведени, и 0, ако съответно не образуват.

//zad11 Въвеждат се 4 цели числа. Да се отпечата 1, ако числата образуват геометрична прогресия в реда, 
// в който са въведени, и 0, ако съответно не образуват.

//zad12 Напишете програма, при която се въвежда реално число (радиус на кръг). 
// Програмата да изчисли и отпечата периметъра и лицето на кръга.

//zad13  Напишете програма, при която се въвеждат две реални числа (две страни на правоъгълник). 
//Програмата да изчисли и отпечата периметъра и лицето на правоъгълника. Програмата да отпечатва дали правоъгълника е и квадрат.

//zad14 Напишете програма, при която се въвежда цяло положително число (секунди). 
//Програмата да изчисли и отпечата колко часа, минути и секунди са въведеното число.

//zad15 Напишете програма, при която се въвежда цяло четирицифрено число. Програмата да отпечата 1 ако то е палиндром и 0 ако не е.

//Напишете програма, при която се въвеждат две положителни реални числа (координати на точка x и y). 
//Програмата да отпечата разстоянието от центъра на координатната система до въведената точка.

//zad17
//Рожден ден
//
//За рожденият ден на дъщеря си, Ивана е решила да организира парти, на което да покани всичките ѝ съученици.За целта е решила да наеме развлекателна зала за деца, чийто наем ще получите като вход от конзолата.
//
//Напишете програма, с която да помогнете на Ивана да изчисли какъв бюджет ще ѝ бъде необходим, като имате следната информация за допълнителните неща, необходими за тържеството :
//
//Торта - цената ѝ е 20 % от наема на залата
//Напитки - цената им е 45 % по - малко от тази на тортата
//Аниматор - цената му е 1 / 3 от цената за наема на залата

//zad18
//Румен иска да пребоядиса хола и за целта е наел майстори.Материалите за ремонта имат следните цени :
//
//Предпазен найлон - 2.50 лв.за кв.метър
//Боя - 14.25 лв.за литър
//Разредител за боя - 5.00 лв.за литър
//За всеки случай, към необходимите материали, Румен иска да добави още 10 % от количеството боя и 3 кв.м.найлон, разбира се и 0.40 лв.за торбички.Сумата, която се заплаща на майсторите за 1 час труд, е равна на 30 % от сбора на всички разходи за материали.
//
//Напишете програма, при която се въвежда количествата на предпазения найлон, боята, разредителя за боята и часове труд на работниците.Програмата да пресмята и отпечата цената на ремонта.

#include <iostream>

int main()
{
	/*zad1
	int a;
	std::cin >> a;
	std::cout << ((a >= 1) && (a <= 31));*/

	//zad2
	// double bgn;
	//std::cin >> bgn;
	//std::cout << bgn / 1.9558;

	/*zad3
	int num;
	std::cin >> num;
	std::cout << num % 10;*/

	/*zad4
	char ch;
	std::cin >> ch;
	std::cout << (ch == 'a' || ch == 'e' || ch == 'i' || ch == 'o' || ch == 'u' || 
	ch == 'A' || ch == 'E' || ch == 'I' || ch == 'O' || ch == 'U');*/

	//zad5
	//char ch,res;
	//std::cin >> ch;
	//res = ch-32;
	//std::cout << res;

	//zad6
	//short a, b, sum;
	//std::cin >> a >> b;
	//sum = (a % 10) * (b / 10);
	//std::cout << sum;

	//zad 7
	/*int a,a1,a2,a3;
	std::cin >> a;
	a3 = a % 10;
	a = a / 10;
	a2 = a % 10;
	a1 = a / 10;
	std::cout << (a1+10*a2+100*a3);*/

	//zad8
	//int a,a1,a2,a3;
	//std::cin >> a;
	//a3 = a % 10;
	//a = a / 10;
	//a2 = a % 10;
	//a1 = a / 10;
	//std::cout << (a1 + a2 + a3);

	/*zad9
	char ch;
	std::cin >> ch;
	int a = ch-96;
	std::cout << a;
	*/

	//zad10
	//int a0, a1, a2, a3;
	//std::cin >> a0 >> a1 >> a2 >> a3;
	//std::cout << ((a3-a2)==(a2-a1)&&(a2-a1) == (a1 - a0));

	//zad11
	/*int a0, a1, a2, a3;
	std::cin >> a0 >> a1 >> a2 >> a3;
	std::cout << ((a3 / a2) == (a2 / a1) && (a2 / a1) == (a1 / a0));*/

	//zad12
	/*double r,area,C;
	double pi = 3.14159;
	std::cin >> r;
	area = r * r * pi;
	C = 2 * pi * r;
	std::cout << "Perimeter: " << C << std::endl; 
	std::cout << "Area: " << area;*/

	//zad13
	/*int a, b, perimeter, area;
	bool isSquare;
	std::cin >> a >> b;
	perimeter = 2 * (a + b);
	area = a * b;
	isSquare = (a == b);
	std::cout << "Perimeter: " << perimeter << std::endl;
	std::cout << "Area: " << area << std::endl;
	std::cout << "IsSquare: "<<isSquare;*/
	
	//zad14
	/*int sec,min,hours;
	std::cin >> sec;
	min = sec / 60;
	hours = min / 60;
	sec = sec % 60;
	min = min % 60;
	std::cout << hours << " hours, " << min << " minutes and " << sec << " seconds";*/

	//zad15
	//int a;
	//std::cin >> a;
	//int a1, a2, a3, a4;
	//a4 = a % 10;
	//a = a / 10;
	//a3 = a % 10;
	//a = a / 10;
	//a2 = a % 10;
	//a1 = a / 10;
	//std::cout << (a1 == a4 && a2 == a3);

	//zad16
	//double x, y;
	//std::cin >> x >> y;
	//std::cout << "Distance: " << sqrt(x * x + y * y);

	//zad17
	/*int rent, cakePrice, drinksPrice, animatorPrice;
	std::cin >> rent;
	cakePrice = rent * 0.2;
	drinksPrice = cakePrice * 0.55;
	animatorPrice = rent / 3;
	std::cout << "Total budget: " << rent + cakePrice + drinksPrice + animatorPrice;*/

	//zad18
	/*int hoursWorked;
	double totalCost, nylonAmount, paintAmount, thinnerAmount;
	std::cin >> nylonAmount >> paintAmount >> thinnerAmount >> hoursWorked;
	paintAmount *= 1.1;
	nylonAmount += 3;
	totalCost = 0.4;
	totalCost += nylonAmount * 2.5 + paintAmount * 14.25 + thinnerAmount * 5;
	totalCost += 0.3 * totalCost * hoursWorked;
	std::cout << "Total cost: " << totalCost << " lv.";*/
	return 0;
}

