/*
Задача 1 (Време + 15 минути) : Да се напише програма, която въвежда час и минути от 24-часово денонощие и изчислява 
колко ще е часът след 15 минути. Резултатът да се отпечата във формат hh:mm. Часовете винаги са между 0 и 23, а минутите
винаги са между 0 и 59. Часовете и минутите се изписват винаги с по две цифри, с водеща нула когато е необходимо 
Вход: 1 46, Изход: 02:01

Вход: 0 1, Изход: 00:16

Вход: 23 59, Изход: 00:14
*/

#include <iostream>

int main () {
    int hour, minutes;
    std::cin >> hour >> minutes;

    minutes += 15;
    if (minutes > 59)
    {
        minutes -= 60;
        hour += 1;
    }
    if (hour > 23)
    {
        hour -= 24;
    }

    std::cout << (hour < 10 ? "0" : "") << hour << ":" << (minutes < 10 ? "0" : "") << minutes << std::endl;

    return 0;
}